#include <stdio.h>

int main() {
    // Оголошуємо змінні для збереження значень часів, заданих вхідними даними
    int t1, t2, t3;

    // Зчитуємо три натуральних числа зі вхідного рядка
    scanf("%d %d %d", &t1, &t2, &t3);

    // Обчислюємо загальний час, за який гості разом можуть з'їсти пиріг
    // Це можна зробити, знайшовши обернене значення величини t1, t2, та t3,
    // а потім знаходячи суму цих обернених величин
    float total_time = 1.0 / t1 + 1.0 / t2 + 1.0 / t3;

    // Виводимо результат, округлений до двох знаків після коми
    printf("%.2f\n", 1.0 / total_time);

    return 0;
}
